In [51]:
import pandas as pd

In [68]:
dataset_train = pd.read_csv('../dataset/train.csv')
dataset_test = pd.read_csv('../dataset/test.csv')

In [69]:
dataset_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [72]:
dataset_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [73]:
# remove Cabin collumn (so many NaN values)
dataset_train.drop(['Cabin'], axis=1, inplace=True)
dataset_test.drop(['Cabin'], axis=1, inplace=True)

In [74]:
# not usefull columns
dataset_train.drop(['PassengerId', 'Name'], axis=1, inplace=True)
dataset_test.drop(['PassengerId', 'Name'], axis=1, inplace=True)

In [75]:
# remove only 2 NaN values in Embarked column in train dataset
dataset_train.drop(dataset_train[dataset_train['Embarked'].isna()].index, axis=0, inplace=True)

In [76]:
# fill NaN age with mean
dataset_train.loc[dataset_train[(dataset_train['Pclass'] == 1) & (dataset_train['Age'].isna())].index, 'Age'] = 38
dataset_train.loc[dataset_train[(dataset_train['Pclass'] == 2) & (dataset_train['Age'].isna())].index, 'Age'] = 29
dataset_train.loc[dataset_train[(dataset_train['Pclass'] == 3) & (dataset_train['Age'].isna())].index, 'Age'] = 24

dataset_test.loc[dataset_test[(dataset_test['Pclass'] == 1) & (dataset_test['Age'].isna())].index, 'Age'] = 38
dataset_test.loc[dataset_test[(dataset_test['Pclass'] == 2) & (dataset_test['Age'].isna())].index, 'Age'] = 29
dataset_test.loc[dataset_test[(dataset_test['Pclass'] == 3) & (dataset_test['Age'].isna())].index, 'Age'] = 24

In [77]:
# mapping gender
gender = {'female': 0, 'male': 1}
dataset_train['Sex'] = dataset_train['Sex'].map(gender)
dataset_test['Sex'] = dataset_test['Sex'].map(gender)

In [78]:
# age as int
dataset_train['Age'] = dataset_train['Age'].astype(int)
dataset_test['Age'] = dataset_test['Age'].astype(int)

In [79]:
# remove ticket column, sice there are 680 unique kind of tickets
print(dataset_train['Ticket'].describe())
dataset_train.drop(['Ticket'], axis=1, inplace=True)
dataset_test.drop(['Ticket'], axis=1, inplace=True)

count          889
unique         680
top       CA. 2343
freq             7
Name: Ticket, dtype: object

In [80]:
# mapping embarked
embarked = {"S": 0, "C": 1, "Q": 2}
dataset_train['Embarked'] = dataset_train['Embarked'].map(embarked)
dataset_test['Embarked'] = dataset_test['Embarked'].map(embarked)

In [81]:
# new features

In [82]:
# relative and alone
dataset_train['Relatives'] = dataset_train['SibSp'] + dataset_train['Parch']
dataset_train.loc[dataset_train['Relatives'] > 0, 'Alone'] = 0
dataset_train.loc[dataset_train['Relatives'] == 0, 'Alone'] = 1
dataset_train['Alone'] = dataset_train['Alone'].astype(int)
dataset_train.drop(['SibSp', 'Parch'], axis=1, inplace=True)


dataset_test['Relatives'] = dataset_test['SibSp'] + dataset_test['Parch']
dataset_test.loc[dataset_test['Relatives'] > 0, 'Alone'] = 0
dataset_test.loc[dataset_test['Relatives'] == 0, 'Alone'] = 1
dataset_test.drop(['SibSp', 'Parch'], axis=1, inplace=True)
dataset_test['Alone'] = dataset_test['Alone'].astype(int)

In [86]:
dataset_train.head()

   Survived  Pclass  Sex  Age     Fare  Embarked  Relatives  Alone
0         0       3    1   22   7.2500         0          1      0
1         1       1    0   38  71.2833         1          1      0
2         1       3    0   26   7.9250         0          0      1
3         1       1    0   35  53.1000         0          1      0
4         0       3    1   35   8.0500         0          0      1

In [83]:
dataset_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 8 columns):
Survived     889 non-null int64
Pclass       889 non-null int64
Sex          889 non-null int64
Age          889 non-null int64
Fare         889 non-null float64
Embarked     889 non-null int64
Relatives    889 non-null int64
Alone        889 non-null int64
dtypes: float64(1), int64(7)
memory usage: 102.5 KB

In [84]:
dataset_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
Pclass       418 non-null int64
Sex          418 non-null int64
Age          418 non-null int64
Fare         417 non-null float64
Embarked     418 non-null int64
Relatives    418 non-null int64
Alone        418 non-null int64
dtypes: float64(1), int64(6)
memory usage: 23.0 KB

In [85]:
dataset_train.to_csv('../dataset/train_preprocessing.csv', index=False)
dataset_test.to_csv('../dataset/test_preprocessing.csv', index=False)